<a href="https://colab.research.google.com/github/collinsbett1/week3_IP/blob/main/Python_Week3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.0 Importing the libraries to be used.

In [ ]:
# Let's import the Pandas library
import pandas as pd
# and Numpy as well.
import numpy as np

1.1 Loading the required databases

In [ ]:
# Load the cells_geo dataset
cells_geo = pd.read_csv('cells_geo.csv' , header = 0, index_col= 0, delimiter=';')
cells_geo.head()

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

In [ ]:
# Load the dataset for the first day.
dataset1 = pd.read_csv('http://bit.ly/Telcom_dataset1')
dataset1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# Drop irrelevant columns
dataset1.drop(['CELL_ON_SITE' , 'COUNTRY_A' , 'COUNTRY_B'] , axis = 1 , inplace = True)
dataset1.head()

  PRODUTC  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv

[5 rows x 7 columns]

In [ ]:
# Rename the columns so as to have matching names with the other datasets.
dataset1.columns = ['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']
dataset1.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv

[5 rows x 7 columns]

In [ ]:
# Load the dataset for the second day.
dataset2 = pd.read_csv('http://bit.ly/Telcom_dataset3')
dataset2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
# Drop unnecessary columns.
dataset2.drop(['CELL_ON_SITE' , 'COUNTRY_A' , 'COUNTRY_B'], axis= 1, inplace = True)
# Rename the columns so as to have matching names with the other datasets.
dataset2.columns = ['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']
dataset2.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA

[5 rows x 7 columns]

In [ ]:
#Load the dataset for day 3.
dataset3 = pd.read_csv('http://bit.ly/Telcom_dataset3')
dataset3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
# Drop irrelevant columns.
dataset3.drop(['CELL_ON_SITE' , 'COUNTRY_A' , 'COUNTRY_B'], axis=1, inplace=True)
# Rename the columns so as to have matching names with the other datasets.
dataset3.columns = ['PRODUCT','VALUE', 'DATE_TIME', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'CELL_ID','SITE_ID']
dataset3.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA

[5 rows x 7 columns]

In [ ]:
# Load the cells_geo_description dataset
cells_geo_description = pd.read_excel('cells_geo_description.xlsx')
cells_geo_description

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
# Load the CDR_description dataset.
CDR_description = pd.read_excel('CDR_description.xlsx')
CDR_description

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
# Drop irrelevant columns from cells_geo dataframe.
cells_geo.drop(['LATITUDE' , 'LONGITUDE'], axis = 1 ,inplace= True)
cells_geo.head()

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 9 columns]

1.2 Analyzing the Datasets.

Next, we are going to analayze the state of the datasets by finding out;
 * The shape of the datasets.
 * The datatypes in each column.
 * The missing data in each dataset.

1.2.1 cells_geo Dataset.

In [ ]:
# Let's find the shape of the cells_geo dataser(number of rows and columns)
cells_geo.shape

(3974, 9)

In [ ]:
# Let's get the data types in each columns.
cells_geo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3974 entries, 0 to 3973
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        3974 non-null   object
 1   STATUS        3907 non-null   object
 2   LOCALISATION  3974 non-null   object
 3   DECOUPZONE    3974 non-null   object
 4   ZONENAME      3968 non-null   object
 5   REGION        3974 non-null   object
 6   AREA          3951 non-null   object
 7   CELL_ID       3974 non-null   object
 8   SITE_CODE     3974 non-null   object
dtypes: object(9)
memory usage: 310.5+ KB

In [ ]:
# The number of missing values in each columns.
cells_geo.isnull().sum()

VILLES           0
STATUS          67
LOCALISATION     0
DECOUPZONE       0
ZONENAME         6
REGION           0
AREA            23
CELL_ID          0
SITE_CODE        0
dtype: int64

In [ ]:
# Next, we'll replace the missing values to NaN
cells_geo.replace('N/A', np.NaN)
cells_geo.head()

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 9 columns]

1.2.2 First day's dataset.

In [ ]:
# Let's find the shape of the cells_geo dataset
dataset1.shape

(5001, 7)

In [ ]:
# Let's get the data types in each columns.
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   DW_A_NUMBER_INT  5001 non-null   object
 4   DW_B_NUMBER_INT  5001 non-null   object
 5   CELL_ID          5001 non-null   object
 6   SITE_ID          4285 non-null   object
dtypes: int64(1), object(6)
memory usage: 273.6+ KB

In [ ]:
# The number of missing values in each columns.
dataset1.isnull().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID              0
SITE_ID            716
dtype: int64

1.2.3 Second day's Dataset.

In [ ]:
# Let's find the shape of the cells_geo dataset
dataset2.shape

(5001, 7)

In [ ]:
# Let's get the data types in each columns.
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   DW_A_NUMBER_INT  5001 non-null   object
 4   DW_B_NUMBER_INT  5001 non-null   object
 5   CELL_ID          5001 non-null   object
 6   SITE_ID          4396 non-null   object
dtypes: int64(1), object(6)
memory usage: 273.6+ KB

In [ ]:
# The number of missing values in each columns.
dataset3.isnull().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID              0
SITE_ID            605
dtype: int64

1.2.4 Third day's dataset

In [ ]:
# Let's find the shape of the cells_geo dataset
dataset3.shape

(5001, 7)

In [ ]:
# Let's get the data types in each columns.
dataset3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   DW_A_NUMBER_INT  5001 non-null   object
 4   DW_B_NUMBER_INT  5001 non-null   object
 5   CELL_ID          5001 non-null   object
 6   SITE_ID          4396 non-null   object
dtypes: int64(1), object(6)
memory usage: 273.6+ KB

In [ ]:
# The number of missing values in each columns.
dataset3.isnull().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID              0
SITE_ID            605
dtype: int64

1.3 Merging the Datasets.

In [ ]:
# We'll merge the cells_geo dataset to the first day's dataset
first_cell = dataset1.merge(cells_geo, how='inner', on='CELL_ID')
first_cell.head()

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, REGION, AREA, SITE_CODE]
Index: []

In [ ]:
# number of rows and columns in the first merged data set
first_cell.shape

(0, 15)

In [ ]:
# We'll merge the cells_geo dataset to the second day's dataset
second_cell = dataset2.merge(cells_geo, how='inner', on='CELL_ID')
second_cell.head()

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, REGION, AREA, SITE_CODE]
Index: []

In [ ]:
# We'll merge the cells_geo dataset to the second day's dataset
third_cell = dataset3.merge(cells_geo, how='inner', on='CELL_ID')
third_cell.head()

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, REGION, AREA, SITE_CODE]
Index: []

In [ ]:
# We'll then proceed to merge the three datasets.
combined_dataset = pd.concat([first_cell, second_cell, third_cell], ignore_index= False, sort= False)
combined_dataset.head()

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, REGION, AREA, SITE_CODE]
Index: []

In [ ]:
# Let's analyse the datatypes in the combined_datatype
combined_dataset.dtypes

PRODUCT                    object
VALUE                       int64
DATE_TIME          datetime64[ns]
DW_A_NUMBER_INT            object
DW_B_NUMBER_INT            object
CELL_ID                    object
SITE_ID                    object
VILLES                     object
STATUS                     object
LOCALISATION               object
DECOUPZONE                 object
ZONENAME                   object
REGION                     object
AREA                       object
SITE_CODE                  object
DATE               datetime64[ns]
TIME               datetime64[ns]
dtype: object

In [ ]:
# We'LL then going to change the DATE_TIME to a datatime type.
combined_dataset.DATE_TIME = pd.to_datetime(combined_dataset.DATE_TIME)

In [ ]:
# We'll then split the DATE_TIME to date and time.
combined_dataset['DATE'] = [d.date() for d in combined_dataset.DATE_TIME]

combined_dataset['TIME'] = [d.time() for d in combined_dataset.DATE_TIME]

combined_dataset['DATE'] = pd.to_datetime(combined_dataset['DATE'])

combined_dataset['TIME'] = pd.to_datetime(combined_dataset['TIME'], format='%H:%M:%S:%f', errors = 'ignore')

In [ ]:
# Let's see if the DATE_TIME column has changed.
combined_dataset.dtypes

PRODUCT                    object
VALUE                       int64
DATE_TIME          datetime64[ns]
DW_A_NUMBER_INT            object
DW_B_NUMBER_INT            object
CELL_ID                    object
SITE_ID                    object
VILLES                     object
STATUS                     object
LOCALISATION               object
DECOUPZONE                 object
ZONENAME                   object
REGION                     object
AREA                       object
SITE_CODE                  object
DATE               datetime64[ns]
TIME               datetime64[ns]
dtype: object

In [ ]:
combined_dataset.head()

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, REGION, AREA, SITE_CODE, DATE, TIME]
Index: []

In [ ]:
# We'll then check for missing values.
combined_dataset.isnull().sum()

PRODUCT            0
VALUE              0
DATE_TIME          0
DW_A_NUMBER_INT    0
DW_B_NUMBER_INT    0
CELL_ID            0
SITE_ID            0
VILLES             0
STATUS             0
LOCALISATION       0
DECOUPZONE         0
ZONENAME           0
REGION             0
AREA               0
SITE_CODE          0
DATE               0
TIME               0
dtype: int64

1.4 Let's analyse the combined_dataset.

Which of the cities were the most used city for the three days?

In [ ]:
#Which of the cities were the most used city for the three days?
combined_dataset.groupby(['DATE' , 'VILLES']).size()

Series([], dtype: int64)

Which cities used MTN the most during business and home hours over the three days?

In [ ]:
# Which cities used MTN the most during business and home hours over the three days?
combined_dataset.groupby('VILLES')['VILLES'].count().sort_values(ascending = False)

Series([], Name: VILLES, dtype: int64)

Find the product which was used each and every day for the 3 days.

In [ ]:
#Find the product which was used each and every day for the 3 days.

combined_dataset.groupby(['DATE', 'PRODUCT'])['PRODUCT'].count().sort_values(ascending = False)

Series([], Name: PRODUCT, dtype: int64)

Cities with high activity within business hours.

In [ ]:
# Let's define business hours.
business_hours = combined_dataset[(combined_dataset.DATE_TIME.dt.TIME >= DATE_TIME.TIME(9)) & (combined_dataset.DATE_TIME.dt.TIME <= DATE_TIME.TIME(17))]

business_hours.head()

AttributeError: ignored

In [ ]:
# Cities with high activity within business hours.
business_hours.groupby('VILLES')['VILLES'].count().sort_values(ascending = False).head(10)

NameError: ignored

In [75]:
# Let's define home hours
home_hours = daily[~ ((combined_dataset.DATE_TIME.dt.TIME >= DATE_TIME.TIME(9)) & (combined_dataset.DATE_TIME.dt.TIME <= DATE_TIME.TIME(17)))]
home_hours.head()

NameError: ignored

In [76]:
# Cities with high activity within home hours.
home_hours.groupby('VILLES')['VILLES'].count().sort_values(ascending = False).head(10)

NameError: ignored